In [3]:
import pandas as pd
import numpy as np

In [4]:
maasSozluk={"Isim":["Ayberg","Cemre","Tugba","Atil"],
           "Depertman":["Yazilim","Satis","Pazarlama","Yazilim"],
            "Maas":[200,300,400,500]
           }

In [6]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [7]:
maasDataFrame

     Isim  Depertman  Maas
0  Ayberg    Yazilim   200
1   Cemre      Satis   300
2   Tugba  Pazarlama   400
3    Atil    Yazilim   500

In [8]:
maasDataFrame["Depertman"].unique()

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [9]:
maasDataFrame["Depertman"].nunique()

3

In [10]:
maasDataFrame["Depertman"].value_counts()

Yazilim      2
Satis        1
Pazarlama    1
Name: Depertman, dtype: int64

In [15]:
def bruttenNete(maas):
    return maas*0.66
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [16]:
maasDataFrame.isnull()

    Isim  Depertman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [22]:
yeniBirVeri={"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
            "Karakter Ismi":["Cartman","Kenny","Bart","Homer","Homer"],
             "Puan":[10,14,23,15,45]
            }

In [23]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [24]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Puan
0      South Park       Cartman    10
1      South Park         Kenny    14
2         Simpson          Bart    23
3         Simpson         Homer    15
4         Simpson         Homer    45

In [25]:
karakterDF.pivot_table(values="Puan",index=["Karakter Sınıfı","Karakter Ismi"])

                               Puan
Karakter Sınıfı Karakter Ismi
Simpson         Bart             23
                Homer            30
South Park      Cartman          10
                Kenny            14